#### 🖌 Terraform Format and Style: `success`
#### ⚙️ Terraform Initialization: `success`
#### 🤖 Terraform Validation: `success`
#### 📖 Terraform Plan: `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.github_repo["go-names"].github_repository.repo: Refreshing state... [id=go-names]
module.github_repo["frajer"].github_repository.repo: Refreshing state... [id=frajer]
module.github_repo["dpd-test"].github_repository.repo: Refreshing state... [id=dpd-test]
module.github_repo["maze"].github_repository.repo: Refreshing state... [id=maze]
module.github_repo["wsl-setup"].github_repository.repo: Refreshing state... [id=wsl-setup]
module.github_repo["go-time-to-block"].github_repository.repo: Refreshing state... [id=go-time-to-block]
module.github_repo["go-game-of-life"].github_repository.repo: Refreshing state... [id=go-game-of-life]
module.github_repo["goit"].github_repository.repo: Refreshing state... [id=goit]
module.github_repo["vaclav-dvorak"].github_repository.repo: Refreshing state... [id=vaclav-dvorak]
module.github_repo["roguna"].github_repository.repo: Refreshing state... [id=roguna]
module.github_repo["go-cci-trigger"].github_repository.repo: Refreshing state... [id=go-cci-trigger]
module.github_repo["anna-helmova"].github_repository.repo: Refreshing state... [id=anna-helmova]
module.github_repo["summit-pokemon"].github_repository.repo: Refreshing state... [id=summit-pokemon]
module.github_repo["vccsturm"].github_repository.repo: Refreshing state... [id=vccsturm]
module.github_repo["go-telegram-test"].github_repository.repo: Refreshing state... [id=go-telegram-test]
module.github_repo["game-of-life"].github_repository.repo: Refreshing state... [id=game-of-life]
module.github_repo["summit-formule"].github_repository.repo: Refreshing state... [id=summit-formule]
module.github_repo["go-api-hello-world"].github_repository.repo: Refreshing state... [id=go-api-hello-world]
module.github_repo["svelte-veribi-dashboard"].github_repository.repo: Refreshing state... [id=svelte-veribi-dashboard]
module.github_repo["go-mandel"].github_repository.repo: Refreshing state... [id=go-mandel]
module.github_repo["toulky"].github_repository.repo: Refreshing state... [id=toulky]
module.github_repo["veribi-cli"].github_repository.repo: Refreshing state... [id=veribi-cli]
module.github_repo["fiddo"].github_repository.repo: Refreshing state... [id=fiddo]
module.github_repo["go-btc-mayer-bot"].github_repository.repo: Refreshing state... [id=go-btc-mayer-bot]
module.github_repo["apprepo-dash"].github_repository.repo: Refreshing state... [id=apprepo-dash]
module.github_repo["mefbox"].github_repository.repo: Refreshing state... [id=mefbox]
module.github_repo["devops-workshop"].github_repository.repo: Refreshing state... [id=devops-workshop]
module.github_repo["bara"].github_repository.repo: Refreshing state... [id=bara]
module.github_repo["go101"].github_repository.repo: Refreshing state... [id=go101]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.github_repo["anna-helmova"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "anna-helmova"
      - name                   = "anna-helmova" -> null
        # (28 unchanged attributes hidden)
    }

  # module.github_repo["apprepo-dash"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "apprepo-dash"
      - name                   = "apprepo-dash" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["bara"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "bara"
      - name                   = "bara" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["devops-workshop"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "devops-workshop"
      - name                   = "devops-workshop" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["dpd-test"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "dpd-test"
      - name                   = "dpd-test" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["fiddo"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "fiddo"
      - name                   = "fiddo" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["frajer"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "frajer"
      - name                   = "frajer" -> null
        # (28 unchanged attributes hidden)
    }

  # module.github_repo["game-of-life"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "game-of-life"
      - name                   = "game-of-life" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["go-api-hello-world"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "go-api-hello-world"
      - name                   = "go-api-hello-world" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["go-btc-mayer-bot"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "go-btc-mayer-bot"
      - name                   = "go-btc-mayer-bot" -> null
        # (30 unchanged attributes hidden)
    }

  # module.github_repo["go-cci-trigger"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "go-cci-trigger"
      - name                   = "go-cci-trigger" -> null
        # (29 unchanged attributes hidden)
    }

  # module.github_repo["go-game-of-life"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "go-game-of-life"
      - name                   = "go-game-of-life" -> null
        # (29 unchanged attributes hidden)
    }

  # module.github_repo["go-mandel"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "go-mandel"
      - name                   = "go-mandel" -> null
        # (30 unchanged attributes hidden)
    }

  # module.github_repo["go-names"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "go-names"
      - name                   = "go-names" -> null
        # (30 unchanged attributes hidden)
    }

  # module.github_repo["go-telegram-test"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "go-telegram-test"
      - name                   = "go-telegram-test" -> null
        # (29 unchanged attributes hidden)
    }

  # module.github_repo["go-time-to-block"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "go-time-to-block"
      - name                   = "go-time-to-block" -> null
        # (30 unchanged attributes hidden)
    }

  # module.github_repo["go101"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "go101"
      - name                   = "go101" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["goit"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "goit"
      - name                   = "goit" -> null
        # (30 unchanged attributes hidden)
    }

  # module.github_repo["maze"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "maze"
      - name                   = "maze" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["mefbox"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "mefbox"
      - name                   = "mefbox" -> null
        # (28 unchanged attributes hidden)
    }

  # module.github_repo["roguna"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "roguna"
      - name                   = "roguna" -> null
        # (29 unchanged attributes hidden)
    }

  # module.github_repo["summit-formule"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "summit-formule"
      - name                   = "summit-formule" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["summit-pokemon"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "summit-pokemon"
      - name                   = "summit-pokemon" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["svelte-veribi-dashboard"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "svelte-veribi-dashboard"
      - name                   = "svelte-veribi-dashboard" -> null
        # (30 unchanged attributes hidden)
    }

  # module.github_repo["toulky"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "toulky"
      - name                   = "toulky" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["vaclav-dvorak"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "vaclav-dvorak"
      - name                   = "vaclav-dvorak" -> null
        # (27 unchanged attributes hidden)
    }

  # module.github_repo["vccsturm"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "vccsturm"
      - name                   = "vccsturm" -> null
        # (28 unchanged attributes hidden)
    }

  # module.github_repo["veribi-cli"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "veribi-cli"
      - name                   = "veribi-cli" -> null
        # (29 unchanged attributes hidden)
    }

  # module.github_repo["wsl-setup"].github_repository.repo has been deleted
  - resource "github_repository" "repo" {
        id                     = "wsl-setup"
      - name                   = "wsl-setup" -> null
        # (28 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github_repo["anna-helmova"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Web Aničky"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "anna-helmova"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["apprepo-dash"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Dashboard for app repositories"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "apprepo-dash"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["bara"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Bara na Zelandu"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "bara"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["devops-workshop"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Rebood devops workshop"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "devops-workshop"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["dpd-test"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "test of DPD api"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "dpd-test"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["fiddo"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Fiddo technical assesment"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "fiddo"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["frajer"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Frajer v červenci"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "frajer"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["game-of-life"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Simple implementation of game of life in node.js"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "game-of-life"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["go-api-hello-world"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Simple hello world api written in golang"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-api-hello-world"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["go-btc-mayer-bot"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Coinbase bot controling trading orders based on Mayer Multiple"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-btc-mayer-bot"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["go-cci-trigger"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Trigger Circle CI job with golang"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-cci-trigger"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["go-game-of-life"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Simple implementation of game of life in golang"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-game-of-life"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["go-mandel"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Simple implementation of z^2 mandelbrot set"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-mandel"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["go-names"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Name search exercise with BoubleTee TUI"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-names"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["go-telegram-test"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Attempt on telegram bot with golang"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-telegram-test"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["go-time-to-block"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Converts time to btc block number"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go-time-to-block"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["go101"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Golang playground"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "go101"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["goit"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Git helper terminal tool"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "goit"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["maze"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Find way in maze (Computerphile)"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "maze"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["mefbox"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Mefovo hřiště"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "mefbox"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["roguna"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Playground for roguelike game"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "roguna"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["summit-formule"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Summit workshop - formule"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "summit-formule"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["summit-pokemon"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Summit workshop - pokemon"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "summit-pokemon"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["svelte-veribi-dashboard"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Exercise in Svelte for Veribi"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "svelte-veribi-dashboard"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["toulky"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "App for our trips"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "toulky"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["vaclav-dvorak"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Vaclav Dvorak profile page"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "vaclav-dvorak"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["vccsturm"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Veteran Car Club Sturm"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "vccsturm"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # module.github_repo["veribi-cli"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Command line interface for Veribi platform"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Go"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "veribi-cli"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github_repo["wsl-setup"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = false
      + allow_rebase_merge     = true
      + allow_squash_merge     = false
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Used for setup of wsl and ubuntu"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + gitignore_template     = "Node"
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + license_template       = "mit"
      + name                   = "wsl-setup"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Warning: Redundant ignore_changes element

  on _module/main.tf line 10, in resource "github_repository" "repo":
  10: resource "github_repository" "repo" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute branches is decided by the provider alone and therefore there
can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vaclav-dvorak, Action: `pull_request`*